# Калькулятор:
# Создайте калькулятор используя классы, методы и атрибуты.
# Создайте 4 метода add (Сложить), subtract (вычесть), Multiply ( умножить), divide
# (деление) и в конце создайте функцию main в котором можно будет вызывать все 4
# метода. Числа и так же шаг запрашивайте с помощью input


class Calculator:
    def __init__(self, num1, num2):
        self.num1 = num1
        self.num2 = num2

    def add(self):
        return self.num1 + self.num2

    def subtract(self):
        return self.num1 - self.num2

    def multiply(self):
        return self.num1 * self.num2

    def divide(self):
        if self.num2 != 0:
            return self.num1 / self.num2
        else:
            return "Ошибка: деление на ноль"


def main():
    num1 = float(input("Введите первое число: "))
    num2 = float(input("Введите второе число: "))

    calc = Calculator(num1, num2)

    print("Сумма:", calc.add())
    print("Разность:", calc.subtract())
    print("Произведение:", calc.multiply())
    print("Частное:", calc.divide())


if __name__ == "__main__":
    main()

# ДОП:
# Загрузить проект в GITHUB
# Загрузила
